const icons = ['🍉', '🍎', '🍞', '🥜', '🥐', '🥖', '🥨', '🥞', '🧇', '🧀', '🍖', '🥓', '🍔', '🍕', '🌭', '🥪', '🌮', '🌯', '🫔', '🧆', '🥣', '🍿', '🍱', '🍙', '🍚', '🍣', '🍦', '🍧', '🍨', '🍩', '🍪', '🍰', '🧁', '🍭', '🍬', '🍫', '🍯', '🍺', '🐟'];

icons.at(1);
// const icon = document.querySelector('link[rel=icon]');
// const template = `
// <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 32 32" width="32" height="32">
//   <text x="0" y="32" font-size="32">
//     🍉
//   </text>
// </svg>
// `;
// setInterval(() => {
//   icon.href =
// }, 1000);
